[9 Awesome Python Pandas Usages Every Data Scientists Should Know](https://betterprogramming.pub/9-awesome-python-pandas-usages-every-data-scientists-should-know-62911eed81e9)

`lr_simple_life_satisfaction_1.ipynb`

# Create a dataframe from a dictionary and display it

In [1]:
import pandas as pd

employees = {
    'Name of Employee': ['Jon','Mark','Tina','Maria','Bill','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill'],
    'Sales': [1000,300,400,500,1000,500,700,50,60,1000,900,750,200,300,1000,900,250,750,50],
    'Quarter': [1,1,1,1,1,2,2,2,2,3,3,3,3,3,4,4,4,4,4],
    'Country': ['US','Japan','Brazil','UK','Brazil','Japan','Brazil','US','US','US','Japan','Brazil','UK','Brazil','Japan','Japan','Brazil','UK','US']
    }

df = pd.DataFrame(employees, columns= ['Name of Employee','Sales','Quarter','Country'])

In [2]:
print (df.head(3))

  Name of Employee  Sales  Quarter Country
0              Jon   1000        1      US
1             Mark    300        1   Japan
2             Tina    400        1  Brazil

In [3]:
df # w/o print(.) function

   Name of Employee  Sales  Quarter Country
0               Jon   1000        1      US
1              Mark    300        1   Japan
2              Tina    400        1  Brazil
3             Maria    500        1      UK
4              Bill   1000        1  Brazil
5              Mark    500        2   Japan
6              Tina    700        2  Brazil
7             Maria     50        2      US
8              Bill     60        2      US
9               Jon   1000        3      US
10             Mark    900        3   Japan
11             Tina    750        3  Brazil
12            Maria    200        3      UK
13             Bill    300        3  Brazil
14              Jon   1000        4   Japan
15             Mark    900        4   Japan
16             Tina    250        4  Brazil
17            Maria    750        4      UK
18             Bill     50        4      US

## Convert a dataframe column to a numpy array or list

In [4]:
print(df["Name of Employee"].values[:3],'\n')

print(df["Name of Employee"].values.dtype,'\n')

print(type(df["Name of Employee"].values))

['Jon' 'Mark' 'Tina']

object

<class 'numpy.ndarray'>

In [5]:
df.Sales.values[:3]

array([1000,  300,  400], dtype=int64)

In [6]:
print(list(df.Sales.values[:3]))

[1000, 300, 400]

# Filter data

In [7]:
df[df.Sales > 900]

   Name of Employee  Sales  Quarter Country
0               Jon   1000        1      US
4              Bill   1000        1  Brazil
9               Jon   1000        3      US
14              Jon   1000        4   Japan

In [8]:
df[(df.Sales > 900) & (df.Country == 'US')]

  Name of Employee  Sales  Quarter Country
0              Jon   1000        1      US
9              Jon   1000        3      US

In [9]:
df[(df.Sales > 900) & ((df.Country == 'US') | (df.Country=='Brazil'))]

  Name of Employee  Sales  Quarter Country
0              Jon   1000        1      US
4             Bill   1000        1  Brazil
9              Jon   1000        3      US

To filter rows in Pandas by regular expression (regex), we can use the `str.match()` method:

In [10]:
regex = 'J.*'
df[df["Name of Employee"].str.match(regex)]

   Name of Employee  Sales  Quarter Country
0               Jon   1000        1      US
9               Jon   1000        3      US
14              Jon   1000        4   Japan

# Remove columns and rows

Let's remove one column and store the result in a new dataframe:

In [11]:
df2 = df.drop('Quarter', axis = 1) # Remove a column with name "Quarter"
df2.head(3)

  Name of Employee  Sales Country
0              Jon   1000      US
1             Mark    300   Japan
2             Tina    400  Brazil

Let's remove two rows with specified **indices**:

In [12]:
df3 = df.drop(labels = [0,1], axis = 0) # Remove rows with labels 0 and 1 - Note: rows' labels are the indices.
df3.head(3)

  Name of Employee  Sales  Quarter Country
2             Tina    400        1  Brazil
3            Maria    500        1      UK
4             Bill   1000        1  Brazil

# Find an element by its index or position

In [13]:
df.head(5)

  Name of Employee  Sales  Quarter Country
0              Jon   1000        1      US
1             Mark    300        1   Japan
2             Tina    400        1  Brazil
3            Maria    500        1      UK
4             Bill   1000        1  Brazil

In [14]:
print(df.loc[1],'\n\n') # by label / index

print(df.iloc[1]) # by position

Name of Employee     Mark
Sales                 300
Quarter                 1
Country             Japan
Name: 1, dtype: object


Name of Employee     Mark
Sales                 300
Quarter                 1
Country             Japan
Name: 1, dtype: object

In the above, the position and index are the same. But, it's not always the case. Here is an example:

In [15]:
df3.head(3)

  Name of Employee  Sales  Quarter Country
2             Tina    400        1  Brazil
3            Maria    500        1      UK
4             Bill   1000        1  Brazil

In [16]:
df3.loc[2]

Name of Employee      Tina
Sales                  400
Quarter                  1
Country             Brazil
Name: 2, dtype: object

In [17]:
df3.iloc[0]

Name of Employee      Tina
Sales                  400
Quarter                  1
Country             Brazil
Name: 2, dtype: object

You may want to show some specific fields of a record:

In [18]:
df3.loc[2,["Country"]]

Country    Brazil
Name: 2, dtype: object

# Intersection of two dataframes

In [19]:
df1_data = {
    'name': ['aa', 'bb', 'cc'],
    'math score':[15., 18., 19.]
}

df2_data = {
    'name': ['bb', 'aa', 'cc'],
    'physics score':[17., 12., 16.]
}

df1 = pd.DataFrame(df1_data, columns=df1_data.keys())
df2 = pd.DataFrame(df2_data, columns=df2_data.keys())

In [20]:
df3 = pd.merge(df1, df2, on=['name'])
df3

  name  math score  physics score
0   aa        15.0           12.0
1   bb        18.0           17.0
2   cc        19.0           16.0

# Concatenating two dataframes

In [21]:
data_1 = {"name": ["London", "Berlin"],
          "population": [8615246, 3562166],
          "country": ["England", "Germany"]
         }

data_2 = {"name": ["Madrid", "Rome", "Berlin"],
          "population": [3165235, 2874038, 3562166],
          "country": ["Spain", "Italy", "Germany"]
         }

df1 = pd.DataFrame(data_1)
df2 = pd.DataFrame(data_2)

df3 = pd.concat([df1, df2])   # By defualt, axis=0 which determines the axis to concatenate along
df3

     name  population  country
0  London     8615246  England
1  Berlin     3562166  Germany
0  Madrid     3165235    Spain
1    Rome     2874038    Italy
2  Berlin     3562166  Germany

In [22]:
df3 = pd.concat([df1, df2], ignore_index=True) 
df3

     name  population  country
0  London     8615246  England
1  Berlin     3562166  Germany
2  Madrid     3165235    Spain
3    Rome     2874038    Italy
4  Berlin     3562166  Germany

## Drop duplicates

In [23]:
df3.drop_duplicates(keep="last") # keep='first' / 'last' ;  subset=["name"]

     name  population  country
0  London     8615246  England
2  Madrid     3165235    Spain
3    Rome     2874038    Italy
4  Berlin     3562166  Germany

# Sort

In [24]:
df3 = df3.sort_values(by=['name'], ascending=[True])
df3

     name  population  country
1  Berlin     3562166  Germany
4  Berlin     3562166  Germany
0  London     8615246  England
2  Madrid     3165235    Spain
3    Rome     2874038    Italy

# Create a pivot table from a dataframe

In [25]:
employees = {
    'Name of Employee': ['Jon','Mark','Tina','Maria','Bill','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill','Jon','Mark','Tina','Maria','Bill'],
    'Sales': [1000,300,400,500,1000,500,700,50,60,1000,900,750,200,300,1000,900,250,750,50],
    'Quarter': [1,1,1,1,1,2,2,2,2,3,3,3,3,3,4,4,4,4,4],
    'Country': ['US','Japan','Brazil','UK','Brazil','Japan','Brazil','US','US','US','Japan','Brazil','UK','Brazil','Japan','Japan','Brazil','UK','US']
    }

df = pd.DataFrame(employees, columns= ['Name of Employee','Sales','Quarter','Country'])

df.columns

Index(['Name of Employee', 'Sales', 'Quarter', 'Country'], dtype='object')

In [26]:
pv = df.pivot_table(index=['Name of Employee'], aggfunc='sum')

In [27]:
pv

                  Quarter  Sales
Name of Employee
Bill                   10   1410
Jon                     8   3000
Maria                  10   1500
Mark                   10   2600
Tina                   10   2100

Note that the "Country" could not be included when aggregate function is "sum". Because it is a categorical feature.

In this dataframe, index is defined on "Name of Employee". So, we can search based on names.

In [28]:
pv.loc["Bill", ["Sales"]]

Sales    1410
Name: Bill, dtype: int64

# More

## Return unique values

See [here](`https://betterprogramming.pub/9-awesome-python-pandas-usages-every-data-scientists-should-know-62911eed81e9`) - part 4 (value_counts() To Find Unique Values)

In [29]:
df.value_counts()

Name of Employee  Sales  Quarter  Country
Bill              50     4        US         1
Maria             750    4        UK         1
Tina              700    2        Brazil     1
                  400    1        Brazil     1
                  250    4        Brazil     1
Mark              900    4        Japan      1
                         3        Japan      1
                  500    2        Japan      1
                  300    1        Japan      1
Maria             500    1        UK         1
Bill              60     2        US         1
Maria             200    3        UK         1
                  50     2        US         1
Jon               1000   4        Japan      1
                         3        US         1
                         1        US         1
Bill              1000   1        Brazil     1
                  300    3        Brazil     1
Tina              750    3        Brazil     1
dtype: int64

Unique values in each column:

In [30]:
df.Quarter.unique() # Numpy array

array([1, 2, 3, 4], dtype=int64)

## Null (missing) values

In [31]:
import pandas as pd

employees = {
    'Name of Employee': ['Jon','Mark','Tina', 'Maria'],
    'Sales': [1000,None,400,500], # NaN
    'Quarter': [1,1,1,1],
    'Country': ['US','Japan','Brazil', None]
    }

df = pd.DataFrame(employees, columns= ['Name of Employee','Sales','Quarter','Country'])

In [32]:
print(df)

  Name of Employee   Sales  Quarter Country
0              Jon  1000.0        1      US
1             Mark     NaN        1   Japan
2             Tina   400.0        1  Brazil
3            Maria   500.0        1    None

In [33]:
print(df[df.Sales.notnull()]) # Note: df.Sales.notnull() returns a dataframe containing boolean values

  Name of Employee   Sales  Quarter Country
0              Jon  1000.0        1      US
2             Tina   400.0        1  Brazil
3            Maria   500.0        1    None

In [34]:
print(df[df.Sales.isnull()])

  Name of Employee  Sales  Quarter Country
1             Mark    NaN        1   Japan

In [35]:
df['Sales'].isnull().sum() # Count the NaN under a single DataFrame column:

1

In [36]:
df.isnull().values.any() # Check for NaN under an entire DataFrame:

True

In [37]:
df.isnull().sum().sum() # Number of NaN in the whole dataframe

2

## Replace strings

[reference](https://sparkbyexamples.com/pandas/pandas-replace-string-examples/#:~:text=You%20can%20replace%20a%20string,replace()%20with%20lambda%20functions.)

In [38]:
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Spark","Java Language","PySpark","PHP Language"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

         Courses    Fee Duration
0          Spark  22000   30days
1        PySpark  25000   50days
2          Spark  23000   30days
3  Java Language  24000   60days
4        PySpark  26000   35days
5   PHP Language  27000   30days

Let's replace `PySpark` with `Python with Spark`:

In [39]:
df2 = df.replace('PySpark','Python with Spark')
print(df2)

             Courses    Fee Duration
0              Spark  22000   30days
1  Python with Spark  25000   50days
2              Spark  23000   30days
3      Java Language  24000   60days
4  Python with Spark  26000   35days
5       PHP Language  27000   30days

Replace multiple strings in multiple columns:

In [40]:
df2 = df.replace({'Courses': 'Py',            # 'Column name': old value
                  'Duration': 'days'},
                 {'Courses': 'Python with ',  # 'Column name': new value
                  'Duration': ' Days'}, regex=True)
print(df2)

             Courses    Fee Duration
0              Spark  22000  30 Days
1  Python with Spark  25000  50 Days
2              Spark  23000  30 Days
3      Java Language  24000  60 Days
4  Python with Spark  26000  35 Days
5       PHP Language  27000  30 Days

In [41]:
df2 = df.replace({'Courses': 'Language'}, {'Courses': 'Lang'}, regex=True)
print(df2)

     Courses    Fee Duration
0      Spark  22000   30days
1    PySpark  25000   50days
2      Spark  23000   30days
3  Java Lang  24000   60days
4    PySpark  26000   35days
5   PHP Lang  27000   30days

In this case, we can also use simpler alternatives:

In [42]:
df2 = df.replace('Language', 'Lang', regex=True)
print(df2)

     Courses    Fee Duration
0      Spark  22000   30days
1    PySpark  25000   50days
2      Spark  23000   30days
3  Java Lang  24000   60days
4    PySpark  26000   35days
5   PHP Lang  27000   30days

### Replace values within a loop

In [43]:
import pandas as pd
technologies= {
    'Courses':["Spark","PySpark","Spark","Java Language","PySpark","PHP Language"],
    'Fee' :[22000,25000,23000,24000,26000,27000],
    'Duration':['30days','50days','30days','60days','35days','30days']
          }
df = pd.DataFrame(technologies)
print(df)

         Courses    Fee Duration
0          Spark  22000   30days
1        PySpark  25000   50days
2          Spark  23000   30days
3  Java Language  24000   60days
4        PySpark  26000   35days
5   PHP Language  27000   30days

In [44]:
for index, row in df.iterrows():
    df.loc[index, "Fee"] = 25000
print(df)

         Courses    Fee Duration
0          Spark  25000   30days
1        PySpark  25000   50days
2          Spark  25000   30days
3  Java Language  25000   60days
4        PySpark  25000   35days
5   PHP Language  25000   30days

## Fill an empty dataframe

In [45]:
import pandas as pd

In [46]:
column_names = ["a", "b", "c"]

In [47]:
df = pd.DataFrame(columns = column_names)
print(df)

Empty DataFrame
Columns: [a, b, c]
Index: []

Add one row to the end of the dataframe:

In [48]:
len(df.index)

0

In [49]:
df.loc[len(df.index)]=[10, 20, 30]

print(df)

    a   b   c
0  10  20  30

Add multiple rows to the end of the dataframe:

In [50]:
df2 = pd.DataFrame({"a":[11,12,13],"b":[21,22,23],"c":[31,32,33]})

In [51]:
df = df.append(df2, ignore_index=True)
print(df)

    a   b   c
0  10  20  30
1  11  21  31
2  12  22  32
3  13  23  33

C:\Users\abbasi\AppData\Local\Temp\2\ipykernel_14428\3087991870.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True)

In [52]:
df = pd.concat([df, df2], ignore_index=True)
print(df)

    a   b   c
0  10  20  30
1  11  21  31
2  12  22  32
3  13  23  33
4  11  21  31
5  12  22  32
6  13  23  33

## Change date format

In [53]:
import pandas as pd
df = pd.DataFrame({"id":[1,2,3],
                   "date":['28/10/2013', '11/10/2006', '17/10/2009']})
print(df)

   id        date
0   1  28/10/2013
1   2  11/10/2006
2   3  17/10/2009

In [54]:
df["date"].dtype

dtype('O')

In [55]:
df["date"] = pd.to_datetime(df["date"], infer_datetime_format=True)

In [56]:
df["date"].dtype

dtype('<M8[ns]')

In [57]:
print(df)

   id       date
0   1 2013-10-28
1   2 2006-10-11
2   3 2009-10-17

In [58]:
df["date"].dt.strftime('%m/%d/%Y')

0    10/28/2013
1    10/11/2006
2    10/17/2009
Name: date, dtype: object